In [5]:
import pandas as pd
from scripts import project_functions

In [6]:
# Load data from National Names
national_df = project_functions.load_and_process_one('../../data/raw/national/NationalNames.csv')
# Load 4 parts of raw data on State Names
state_df = project_functions.load_and_process_many("../../data/raw/state")

In [7]:
national_df

             Name  Year Gender  Count  Popular
0            Mary  1910      F  22848     True
1           Helen  1910      F  10479     True
2        Margaret  1910      F   8226     True
3         Dorothy  1910      F   7318     True
4            Ruth  1910      F   7212     True
...           ...   ...    ...    ...      ...
1736485    Zykeem  2014      M      5    False
1736486    Zymeer  2014      M      5    False
1736487   Zymiere  2014      M      5    False
1736488     Zyran  2014      M      5    False
1736489     Zyrin  2014      M      5    False

[1736490 rows x 5 columns]

In [8]:
state_df

             Name  Year Gender State  Count  Popular
0            Mary  1910      F    AK     14    False
1           Annie  1910      F    AK     12    False
2            Anna  1910      F    AK     10    False
3        Margaret  1910      F    AK      8    False
4           Helen  1910      F    AK      7    False
...           ...   ...    ...   ...    ...      ...
5647421      Seth  2014      M    WY      5    False
5647422   Spencer  2014      M    WY      5    False
5647423      Tyce  2014      M    WY      5    False
5647424    Victor  2014      M    WY      5    False
5647425    Waylon  2014      M    WY      5    False

[5647426 rows x 6 columns]